DataProcessors/ЗаработнаяПлатаДизайнера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗаработнаяПлатаДизайнера</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ПлановыеПоказателиДизайнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ПлановыеПоказателиДизайнеров</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоказателейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РеализованныеИзделия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>РеализованныеИзделия</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦеноваяКатегория</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыИзделий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КорпуснаяМебель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кухня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШкафКупе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЗаработнаяПлатаДизайнера/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура МесяцВперед(Команда)
	
	ИзменитьПериод(1);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНазад(Команда)
	
	ИзменитьПериод(-1);
	
КонецПроцедуры

&НаКлиенте
Функция ИзменитьПериод(Направление)

	УстановленныйМесяц = Период.ДатаНачала;
	НовыйМесяц = ДобавитьМесяц(УстановленныйМесяц, Направление);
	Период.ДатаНачала = НачалоМесяца(НовыйМесяц);
	Период.ДатаОкончания = КонецМесяца(НовыйМесяц);
	ОбновитьДанныеНаСервере();

КонецФункции // ИзменитьПериод()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	//ИзменитьПериод(0);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ОбновитьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)

	ОбновитьДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Дизайнер) Тогда
		Дизайнер = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	КонецЕсли;
	
	//ПараметрыДолжностей = РегистрыСведений.ПараметрыДолжностей.ПолучитьПоследнее(Период.ДатаНачала, Новый Структура("Подразделение", Дизайнер.Подразделение));
	ПолучитьЗначениеПоказателя();
	//КоличествоЗаключенныхДоговоров = ПолучитьЗначениеПоказателя(Дизайнер, Перечисления.ВидПоказателяСотрудника.КоличествоДоговоров, Период).Факт;

	//УщербОтПеределок = ПолучитьЗначениеПоказателя(Дизайнер, Перечисления.ВидПоказателяСотрудника.УщербОтПеределок, Период).Факт;
	//ЗаключеноДоговоров = ПолучитьЗначениеПоказателя(Дизайнер, Перечисления.ВидПоказателяСотрудника.СтоимостьДоговоров, Период);
	//ПланЗаключеноДоговоров = ЗаключеноДоговоров.План;
	//ФактЗаключеноДоговоров = ЗаключеноДоговоров.Факт;
	//ШтрафБонус = ЛексСервер.ПолучитьСуммуБонуса(ФактЗаключеноДоговоров, ПланЗаключеноДоговоров, ПараметрыДолжностей.ШтрафБонусДизайнеру);
	
	Если ЗначениеЗаполнено(ПланЗаключеноДоговоров) Тогда
		ПроцентВыполненияПлана = "" + Окр(ФактЗаключеноДоговоров / ПланЗаключеноДоговоров * 100, 2) + "%";
	КонецЕсли;
	
	//ПолученоДенегПоДоговорам = ПолучитьЗначениеПоказателя(Дизайнер, Перечисления.ВидПоказателяСотрудника.ВыручкаПоДоговорам, Период).Факт;
	//ОкладЗаМесяц = ПараметрыДолжностей.ОкладДизайнера;

	//ЗарплатаОтВыручки = ПараметрыДолжностей.ПроцентСОплатыДизайнер / 100 * ПолученоДенегПоДоговорам;

КонецФункции // ОбновитьДанныеНаСервере()

&НаСервере
Функция ПолучитьЗначениеПоказателя()

	Ответ = Новый Структура("План, Факт", 0, 0);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Дизайнер.Подразделение);
	Запрос.УстановитьПараметр("Сотрудник", Дизайнер);
	//Запрос.УстановитьПараметр("Показатель", Показатель);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОбороты.СуммаОборот,
	|	УправленческийОбороты.Субконто2,
	|	УправленческийОбороты.Субконто1
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			,
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто2 = &Сотрудник
	|				И ТИПЗНАЧЕНИЯ(Субконто1) = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСотрудников),
	|			,
	|			) КАК УправленческийОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеПоказателиДизайнеровОбороты.Дизайнер,
	|	ПлановыеПоказателиДизайнеровОбороты.Показатель КАК ПлановыйПоказатель,
	|	ПлановыеПоказателиДизайнеровОбороты.ЗначениеОборот
	|ИЗ
	|	РегистрНакопления.ПлановыеПоказателиДизайнеров.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			Дизайнер = &Сотрудник
	|				И Подразделение = &Подразделение) КАК ПлановыеПоказателиДизайнеровОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализованныеИзделияОбороты.ВидИзделия,
	|	РеализованныеИзделияОбороты.КоличествоОборот КАК КоличествоКухонь,
	|	NULL КАК КоличествоНеКухонь
	|ИЗ
	|	РегистрНакопления.РеализованныеИзделия.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			Дизайнер = &Сотрудник
	|				И Подразделение = &Подразделение
	|				И ВидИзделия = ЗНАЧЕНИЕ(Перечисление.ВидыИзделий.Кухня)) КАК РеализованныеИзделияОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	РеализованныеИзделияОбороты.КоличествоОборот
	|ИЗ
	|	РегистрНакопления.РеализованныеИзделия.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			Дизайнер = &Сотрудник
	|				И Подразделение = &Подразделение
	|				И ВидИзделия <> ЗНАЧЕНИЕ(Перечисление.ВидыИзделий.Кухня)) КАК РеализованныеИзделияОбороты";
	
	ВыборкаПоПланам = Запрос.ВыполнитьПакет()[0].Выбрать();
	ВыборкаПоПоказателям = Запрос.ВыполнитьПакет()[1].Выбрать();
	Возврат Ответ;

КонецФункции // ПолучитьЗначениеПоказателя()
